# 1. Basic Python

In [3]:
print('Hello World')

Hello World

# 2. Reading a csv file

In [6]:
import pandas as pd
path = "C://Users//nath.debraj//Desktop//Python Codes//Python_training_tutordude//13.Data Analysis//CONTENT FILES//auto-mpg.csv"
df=pd.read_csv(path, header= None)
print(df)

              0    1          2             3           4       5  \
0    Unnamed: 0    0          1             2           3       4
1             0  mpg  cylinders  displacement  horsepower  weight
2             1   18          8           307         130    3504
3             2   15          8           350         165    3693
4             3   18          8           318         150    3436
..          ...  ...        ...           ...         ...     ...
395         394   27          4           140          86    2790
396         395   44          4            97          52    2130
397         396   32          4           135          84    2295
398         397   28          4           120          79    2625
399         398   31          4           119          82    2720

                6           7       8                          9
0               5           6       7                          8
1    acceleration  model year  origin                   car name
2              12          70       1  chevrolet chevelle malibu
3            11.5          70       1          buick skylark 320
4              11          70       1         plymouth satellite
..            ...         ...     ...                        ...
395          15.6          82       1            ford mustang gl
396          24.6          82       2                  vw pickup
397          11.6          82       1              dodge rampage
398          18.6          82       1                ford ranger
399          19.4          82       1                 chevy s-10

[400 rows x 10 columns]

# 3. Methods to view file

In [9]:
df.head(5) # to read top 4 of the file

,0,1,2,3,4,5,6,7,8,9
0,Unnamed: 0,0,1,2,3,4,5,6,7,8
1,0,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
2,1,18,8,307,130,3504,12,70,1,chevrolet chevelle malibu
3,2,15,8,350,165,3693,11.5,70,1,buick skylark 320
4,3,18,8,318,150,3436,11,70,1,plymouth satellite

In [8]:
df.tail(5) # to bottom top 4 of the file

       0   1  2    3   4     5     6   7  8                9
395  394  27  4  140  86  2790  15.6  82  1  ford mustang gl
396  395  44  4   97  52  2130  24.6  82  2        vw pickup
397  396  32  4  135  84  2295  11.6  82  1    dodge rampage
398  397  28  4  120  79  2625  18.6  82  1      ford ranger
399  398  31  4  119  82  2720  19.4  82  1       chevy s-10

In [10]:
df.to_csv(path) # Save the file

In [11]:
df.dtypes # to check datatype of a file

0    object
1    object
2    object
3    object
4    object
5    object
6    object
7    object
8    object
9    object
dtype: object

In [12]:
df.describe() #to see a statiscial summary

                 0    1    2    3    4     5     6    7    8           9
count          400  400  400  400  400   400   400  400  400         400
unique         400  131    7   84   96   353    97   15    5         307
top     Unnamed: 0   13    4   97  150  1985  14.5   73    1  ford pinto
freq             1   20  204   21   22     4    23   40  249           6

In [13]:
df.describe(include = 'all') # to see full statistical summary

                 0    1    2    3    4     5     6    7    8           9
count          400  400  400  400  400   400   400  400  400         400
unique         400  131    7   84   96   353    97   15    5         307
top     Unnamed: 0   13    4   97  150  1985  14.5   73    1  ford pinto
freq             1   20  204   21   22     4    23   40  249           6

In [14]:
df.info() # it provides coincisde view of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       400 non-null    object
 1   1       400 non-null    object
 2   2       400 non-null    object
 3   3       400 non-null    object
 4   4       400 non-null    object
 5   5       400 non-null    object
 6   6       400 non-null    object
 7   7       400 non-null    object
 8   8       400 non-null    object
 9   9       400 non-null    object
dtypes: object(10)
memory usage: 31.4+ KB

In [16]:
df.columns # deisplys columns that are occupied

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')